In [1]:
import pandas as pd

In [3]:
pd.Series(['banana',32])

0    banana
1        32
dtype: object

In [7]:
df=pd.DataFrame({"name":['홍길동','김철수'],"Age":[37,43]})

In [8]:
df.T

        0    1
name  홍길동  김철수
Age    37   43

In [17]:
df=pd.read_csv("data/scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [11]:
df.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [16]:
df.mean(axis=1,numeric_only=True)

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
dtype: float64

In [18]:
df.Age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [21]:
df.Age>df.Age.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [26]:
df.Age,df.Age+pd.Series([10,20])

(0    37
 1    61
 2    90
 3    66
 4    56
 5    45
 6    41
 7    77
 Name: Age, dtype: int64,
 0    47.0
 1    81.0
 2     NaN
 3     NaN
 4     NaN
 5     NaN
 6     NaN
 7     NaN
 dtype: float64)

In [27]:
df.sort_index(ascending=False)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [28]:
df_sort=df.sort_values('Age')

In [29]:
df.Age,df_sort.Age+df.Age

(0    37
 1    61
 2    90
 3    66
 4    56
 5    45
 6    41
 7    77
 Name: Age, dtype: int64,
 0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64)

In [32]:
df['born_dt']=pd.to_datetime(df.Born)

In [31]:
date='09-12-24'
pd.to_datetime(date,format='%m-%d-%y')

Timestamp('2024-09-12 00:00:00')

In [34]:
df.head(1)

                Name        Born        Died  Age Occupation    born_dt
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist 1920-07-25